---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElementCalculationLocation
source: html/0bf9ed3c-d5a1-e304-68cd-5711d55ad2f5.htm
---
# SpatialElementCalculationLocation Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.